----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 8, 1024, 2048]             224
              ReLU-2        [-1, 8, 1024, 2048]               0
       BatchNorm2d-3        [-1, 8, 1024, 2048]              16
            Conv2d-4        [-1, 8, 1024, 2048]             584
              ReLU-5        [-1, 8, 1024, 2048]               0
       BatchNorm2d-6        [-1, 8, 1024, 2048]              16
     UNetConvBlock-7        [-1, 8, 1024, 2048]               0
            Conv2d-8        [-1, 16, 512, 1024]           1,168
              ReLU-9        [-1, 16, 512, 1024]               0
      BatchNorm2d-10        [-1, 16, 512, 1024]              32
           Conv2d-11        [-1, 16, 512, 1024]           2,320
             ReLU-12        [-1, 16, 512, 1024]               0
      BatchNorm2d-13        [-1, 16, 512, 1024]              32
    UNetConvBlock-14        [-1, 16, 512, 1024]               0
           Conv2d-15         [-1, 32, 256, 512]           4,640
             ReLU-16         [-1, 32, 256, 512]               0
      BatchNorm2d-17         [-1, 32, 256, 512]              64
           Conv2d-18         [-1, 32, 256, 512]           9,248
             ReLU-19         [-1, 32, 256, 512]               0
      BatchNorm2d-20         [-1, 32, 256, 512]              64
    UNetConvBlock-21         [-1, 32, 256, 512]               0
           Conv2d-22         [-1, 64, 128, 256]          18,496
             ReLU-23         [-1, 64, 128, 256]               0
      BatchNorm2d-24         [-1, 64, 128, 256]             128
           Conv2d-25         [-1, 64, 128, 256]          36,928
             ReLU-26         [-1, 64, 128, 256]               0
      BatchNorm2d-27         [-1, 64, 128, 256]             128
    UNetConvBlock-28         [-1, 64, 128, 256]               0
         Upsample-29         [-1, 64, 256, 512]               0
           Conv2d-30         [-1, 32, 256, 512]           2,080
           Conv2d-31         [-1, 32, 256, 512]          18,464
             ReLU-32         [-1, 32, 256, 512]               0
      BatchNorm2d-33         [-1, 32, 256, 512]              64
           Conv2d-34         [-1, 32, 256, 512]           9,248
             ReLU-35         [-1, 32, 256, 512]               0
      BatchNorm2d-36         [-1, 32, 256, 512]              64
    UNetConvBlock-37         [-1, 32, 256, 512]               0
      UNetUpBlock-38         [-1, 32, 256, 512]               0
         Upsample-39        [-1, 32, 512, 1024]               0
           Conv2d-40        [-1, 16, 512, 1024]             528
           Conv2d-41        [-1, 16, 512, 1024]           4,624
             ReLU-42        [-1, 16, 512, 1024]               0
      BatchNorm2d-43        [-1, 16, 512, 1024]              32
           Conv2d-44        [-1, 16, 512, 1024]           2,320
             ReLU-45        [-1, 16, 512, 1024]               0
      BatchNorm2d-46        [-1, 16, 512, 1024]              32
    UNetConvBlock-47        [-1, 16, 512, 1024]               0
      UNetUpBlock-48        [-1, 16, 512, 1024]               0
         Upsample-49       [-1, 16, 1024, 2048]               0
           Conv2d-50        [-1, 8, 1024, 2048]             136
           Conv2d-51        [-1, 8, 1024, 2048]           1,160
             ReLU-52        [-1, 8, 1024, 2048]               0
      BatchNorm2d-53        [-1, 8, 1024, 2048]              16
           Conv2d-54        [-1, 8, 1024, 2048]             584
             ReLU-55        [-1, 8, 1024, 2048]               0
      BatchNorm2d-56        [-1, 8, 1024, 2048]              16
    UNetConvBlock-57        [-1, 8, 1024, 2048]               0
      UNetUpBlock-58        [-1, 8, 1024, 2048]               0
           Conv2d-59       [-1, 34, 1024, 2048]             306
================================================================
Total params: 113,762
Trainable params: 113,762
Non-trainable params: 0
----------------------------------------------------------------